# MaxRange Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElectricalDemandFactorValue..::..MaxRange Property
ElectricalDemandFactorValue Class See Also
---
The maximum range for this demand factor value. For example, objects 1 to 3 can have 100% demand factor. In the example above, the maximum range will be 3.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public double MaxRange { get; set; }
```

Visual Basic
---
```text
Public Property MaxRange As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double MaxRange {
	double get ();
	void set (double value);
}
```

# See Also
ElectricalDemandFactorValue Class
Autodesk.Revit.DB.Electrical Namespace